content/teaching.org
:PROPERTIES:
:ID:       cbb16489-0d75-4466-bf36-240257da8f58
:END:
#+title: Anand Deopurkar | Teaching
#+DESCRIPTION: Courses taught by of Anand Deopurkar, a mathematician specialising in algebraic geometry at the Australian National University.  Read about my papers and preprints, including abstracts.
#+KEYWORDS: Course, Teaching, Anand Deopurkar, ANU, MSI
#+options: H:1 num:0 toc:nil
#+filetags: course

Below is a roughly reverse chronological list of the courses I have taught with links to course websites and sometimes with other commentary. 

* Games, graphs, and machines                                     :highlight:
:PROPERTIES:
:where: Australian National University
:when:     2025
:links: [[id:6d38a9f2-2aef-4ad5-848f-fcf0443b096d][course page]]
:ID:       2a953d2a-e23a-4c6b-a289-d7eabf2c5372
:END:

* Fields and Galois theory (Algebra 2)                            :highlight:
:PROPERTIES:
:where: Australian National University
:when:     2025
:links: [[id:8da0831f-565c-4a15-b356-7604a5ac0c1b][course page]]
:ID:       61a488d3-6299-41db-8d8f-22a52c218168
:END:

* Games, graphs, and machines 
:PROPERTIES:
:where: Australian National University
:when:     2024
:links: [[id:fadfe4f2-a922-43dd-aba5-1ff6decb91bf][course page]]
:ID:       5e654789-28b9-42a5-a670-40443b50f67e
:END:

* Differential forms in algebraic topology                        :highlight:
:PROPERTIES:
:where: Australian National University
:when:     2024
:comments: Reading course based on R. Bott and L. Tu's book
:links: [[id:d4cff607-a97d-4665-a57e-246aa8d6b8a5][course page]]
:ID:       ff0be012-9844-46a2-b477-6c93891795b0
:END:

* Fields and Galois theory (Algebra 2)
:properties:
:where: Australian National University
:when:     2024
:links: [[id:8dcd2746-9f3c-45eb-9041-c1b62f855e6d][course page]]
:ID:       63b0bcaf-ef9b-44aa-a7c4-e14a8d5acb86
:end:

* Fields and Galois theory (Algebra 2)
:properties:
:where: Australian National University
:when:     2023
:links: [[id:9c4d6293-281c-4a83-9b3e-bfb363114a1f][course page]]
:ID:       bd3ac43e-343e-4a97-8d11-98ff04bc7951
:end:

* Groups and rings (Algebra 1)                                    :highlight:
:properties:
:where: Australian National University
:when:     2022
:ID:       758f10f4-87b2-4f06-bf29-4ff996b8ad98
:links: [[id:e61cc576-b305-4296-b50b-0bc8a5f8aab2][course page]]
:end:

* Mathematical writing                                            :highlight:
:properties:
:where: Australian National University
:when:     2022
:links: [[id:140c6f8d-abc0-4763-aead-b2834a41f665][course page]]
:ID:       3e570a8d-7ffa-4b1c-b8ac-c2077e6e894c
:end:

* Seminar on derived categories 
:properties:
:where: Australian National University
:when:     2021
:ID:       4f6ebf74-63fb-42da-bedd-984ce59a669e
:links: [[id:37dcbcd5-30ec-489c-bb01-a7b09cde3a17][webpage]]
:end:

** About the seminar

We plan to collaboratively read the book "Fourier-Mukai Transforms in
Algebraic Geometry" by Daniel Huybrechts, and if time permits,
something more. We will meet on Fridays from 1pm to 2:30pm in the MSI
board room (2nd floor).

** Format of the seminar

The seminar has a slightly unusual format. There will be no talks. We
assign ourselves some reading for the week, and we meet for about 1:30
hours once a week to discuss the reading.

This week's reading (to be done by Friday, March 5) is: Chapter 3,
Section 3.1, and whatever is necessary from Chapter 1 and Chapter 2.

** Collaborative whiteboard

To keep the discussions meaningful, I am asking the participants to
note down any questions, comments, requests, insights, frustrations
... whatever... on a collaborative (virtual) whiteboard here:
https://www.mathdown.net/?doc=I7X3CpuNsKa#DbCoh. These notes are
anonymous, so no one will know if you asked a stupid question. Before
the meeting, I'll take the week's harvest and use it as the basis for
discussion. So, in some week, if we end up with 6 questions and a
joke, we'll hear the joke, and then we'll collectively try to answer
the 6 questions.

