teaching.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-06-19 Fri 17:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Anand Deopurkar | Teaching</title>
<meta name="author" content="Anand Deopurkar" />
<meta name="description" content="Courses taught by of Anand Deopurkar, a mathematician specialising in algebraic geometry at the Australian National University.  Read about my papers and preprints, including abstracts." />
<meta name="keywords" content="Course, Teaching, Anand Deopurkar, ANU, MSI" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/main.css"></head>
<body>
<div id="content" class="content">
<h1 class="title">Anand Deopurkar | Teaching</h1>
<div class="properties" id="org67920ee">

</div>

<p>
Below is a roughly reverse chronological list of the courses I have taught with links to course websites and sometimes with other commentary. 
</p>
<div id="outline-container-ID-2a953d2a-e23a-4c6b-a289-d7eabf2c5372" class="outline-2">
<h2 id="ID-2a953d2a-e23a-4c6b-a289-d7eabf2c5372">Games, graphs, and machines</h2>
<div class="outline-text-2" id="text-org1e37b44">
<div class="properties" id="org6c8f665">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2025</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Australian National University</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="teaching/2025_games_graphs_and_machines/index.html#ID-6d38a9f2-2aef-4ad5-848f-fcf0443b096d">course page</a></td>
</tr>
</tbody>
</table>

</div>
</div>
<ul class="org-ul">
<li><a id="org82efc64"></a>What links here?<br />
<div class="outline-text-3" id="text-org82efc64">
<ul class="org-ul">
<li><a href="index.html#ID-d990bcc9-227c-4e82-9e93-512139e14f45">Home</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-ID-61a488d3-6299-41db-8d8f-22a52c218168" class="outline-2">
<h2 id="ID-61a488d3-6299-41db-8d8f-22a52c218168">Fields and Galois theory (Algebra 2)</h2>
<div class="outline-text-2" id="text-orgeb1fc6e">
<div class="properties" id="orgac44b2b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2025</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Australian National University</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="teaching/2025_algebra2/index.html#ID-8da0831f-565c-4a15-b356-7604a5ac0c1b">course page</a></td>
</tr>
</tbody>
</table>

</div>
</div>
<ul class="org-ul">
<li><a id="orgac7cd19"></a>What links here?<br />
<div class="outline-text-3" id="text-orgac7cd19">
<ul class="org-ul">
<li><a href="index.html#ID-d990bcc9-227c-4e82-9e93-512139e14f45">Home</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-ID-5e654789-28b9-42a5-a670-40443b50f67e" class="outline-2">
<h2 id="ID-5e654789-28b9-42a5-a670-40443b50f67e">Games, graphs, and machines</h2>
<div class="outline-text-2" id="text-org8476880">
<div class="properties" id="org652d899">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2024</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Australian National University</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="teaching/2024_games_graphs_and_machines/index.html#ID-fadfe4f2-a922-43dd-aba5-1ff6decb91bf">course page</a></td>
</tr>
</tbody>
</table>

</div>
</div>
</div>
<div id="outline-container-ID-ff0be012-9844-46a2-b477-6c93891795b0" class="outline-2">
<h2 id="ID-ff0be012-9844-46a2-b477-6c93891795b0">Differential forms in algebraic topology</h2>
<div class="outline-text-2" id="text-orge339bcc">
<div class="properties" id="org3748832">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2024</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Australian National University</td>
</tr>

<tr>
<td class="org-left"><b>comments</b></td>
<td class="org-left">Reading course based on R. Bott and L. Tu&rsquo;s book</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="teaching/2024_differential_forms_in_algebraic_topology/index.html#ID-d4cff607-a97d-4665-a57e-246aa8d6b8a5">course page</a></td>
</tr>
</tbody>
</table>

</div>
</div>
<ul class="org-ul">
<li><a id="orgcde3879"></a>What links here?<br />
<div class="outline-text-3" id="text-orgcde3879">
<ul class="org-ul">
<li><a href="index.html#ID-d990bcc9-227c-4e82-9e93-512139e14f45">Home</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-ID-63b0bcaf-ef9b-44aa-a7c4-e14a8d5acb86" class="outline-2">
<h2 id="ID-63b0bcaf-ef9b-44aa-a7c4-e14a8d5acb86">Fields and Galois theory (Algebra 2)</h2>
<div class="outline-text-2" id="text-org1cb6a80">
<div class="properties" id="org495a904">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2024</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Australian National University</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="teaching/2024_algebra2/index.html#ID-8dcd2746-9f3c-45eb-9041-c1b62f855e6d">course page</a></td>
</tr>
</tbody>
</table>

</div>
</div>
</div>
<div id="outline-container-ID-bd3ac43e-343e-4a97-8d11-98ff04bc7951" class="outline-2">
<h2 id="ID-bd3ac43e-343e-4a97-8d11-98ff04bc7951">Fields and Galois theory (Algebra 2)</h2>
<div class="outline-text-2" id="text-org99f897b">
<div class="properties" id="org2bca6db">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2023</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Australian National University</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="teaching/2023_algebra2/index.html#ID-9c4d6293-281c-4a83-9b3e-bfb363114a1f">course page</a></td>
</tr>
</tbody>
</table>

</div>
</div>
</div>
<div id="outline-container-ID-758f10f4-87b2-4f06-bf29-4ff996b8ad98" class="outline-2">
<h2 id="ID-758f10f4-87b2-4f06-bf29-4ff996b8ad98">Groups and rings (Algebra 1)</h2>
<div class="outline-text-2" id="text-orgf1a15ed">
<div class="properties" id="org4b77b4f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2022</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Australian National University</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="teaching/2022_algebra1/index.html#ID-e61cc576-b305-4296-b50b-0bc8a5f8aab2">course page</a></td>
</tr>
</tbody>
</table>

</div>
</div>
<ul class="org-ul">
<li><a id="org1553fe7"></a>What links here?<br />
<div class="outline-text-3" id="text-org1553fe7">
<ul class="org-ul">
<li><a href="index.html#ID-d990bcc9-227c-4e82-9e93-512139e14f45">Home</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-ID-3e570a8d-7ffa-4b1c-b8ac-c2077e6e894c" class="outline-2">
<h2 id="ID-3e570a8d-7ffa-4b1c-b8ac-c2077e6e894c">Mathematical writing</h2>
<div class="outline-text-2" id="text-orgbf65e9b">
<div class="properties" id="org3bbb4a8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2022</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Australian National University</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="teaching/2022_mathematical_writing/index.html#ID-140c6f8d-abc0-4763-aead-b2834a41f665">course page</a></td>
</tr>
</tbody>
</table>

</div>
</div>
<ul class="org-ul">
<li><a id="org87a351f"></a>What links here?<br />
<div class="outline-text-3" id="text-org87a351f">
<ul class="org-ul">
<li><a href="index.html#ID-d990bcc9-227c-4e82-9e93-512139e14f45">Home</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-ID-4f6ebf74-63fb-42da-bedd-984ce59a669e" class="outline-2">
<h2 id="ID-4f6ebf74-63fb-42da-bedd-984ce59a669e">Seminar on derived categories</h2>
<div class="outline-text-2" id="text-orgd5af4f5">
<div class="properties" id="org6f51650">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2021</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Australian National University</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="seminars/dbcoh/index.html#ID-37dcbcd5-30ec-489c-bb01-a7b09cde3a17">webpage</a></td>
</tr>
</tbody>
</table>

</div>
</div>
<ul class="org-ul">
<li><a id="org383aec3"></a>About the seminar<br />
<div class="outline-text-3" id="text-org383aec3">
<p>
We plan to collaboratively read the book &ldquo;Fourier-Mukai Transforms in
Algebraic Geometry&rdquo; by Daniel Huybrechts, and if time permits,
something more. We will meet on Fridays from 1pm to 2:30pm in the MSI
board room (2nd floor).
</p>
</div>
</li>
<li><a id="orge43d582"></a>Format of the seminar<br />
<div class="outline-text-3" id="text-orge43d582">
<p>
The seminar has a slightly unusual format. There will be no talks. We
assign ourselves some reading for the week, and we meet for about 1:30
hours once a week to discuss the reading.
</p>

<p>
This week&rsquo;s reading (to be done by Friday, March 5) is: Chapter 3,
Section 3.1, and whatever is necessary from Chapter 1 and Chapter 2.
</p>
</div>
</li>
<li><a id="org35a8d7d"></a>Collaborative whiteboard<br />
<div class="outline-text-3" id="text-org35a8d7d">
<p>
To keep the discussions meaningful, I am asking the participants to
note down any questions, comments, requests, insights, frustrations
&#x2026; whatever&#x2026; on a collaborative (virtual) whiteboard here:
<a href="https://www.mathdown.net/?doc=I7X3CpuNsKa#DbCoh">https://www.mathdown.net/?doc=I7X3CpuNsKa#DbCoh</a>. These notes are
anonymous, so no one will know if you asked a stupid question. Before
the meeting, I&rsquo;ll take the week&rsquo;s harvest and use it as the basis for
discussion. So, in some week, if we end up with 6 questions and a
joke, we&rsquo;ll hear the joke, and then we&rsquo;ll collectively try to answer
the 6 questions.
</p>
</div>
</li>
</ul>
</div>
