content/teaching.org
* Algebraic Geometry (Algebra 3)                                  :highlight:
:properties:
:where: Australian National University
:when:     2021
:links: [[id:d86f42ff-f826-4c2a-9e1f-b85a7934e6c0][course page]] 
:ID:       1680737a-9d54-448d-8951-a0fe1ae16016
:end:

* Foundations of Algebraic Geometry: Schemes                      :highlight:
:properties:
:where: Australian National University
:when:     2020
:links: [[id:bf031ad4-94a5-42bd-8606-70e9cf0aec5f][course page]]
:ID:       22f29317-d339-4e49-b46a-17a34e0b6091
:end:

* Seminar on Hodge theory
:properties:
:where: Australian National University
:when:     2019
:ID:       7ec3cecb-0b39-4dac-bafc-8964f7cdded3
:end:

Here is the abstract.

#+begin_abstract
Over 3 weeks, we will review classical notions of Hodge structures and how they arise in complex algebraic geometry. We will then try to understand the construction of Hodge structures from categories of representations (by Geordie Williamson and Ben Elias) and combinatorial geometry (by Peter McMullen, Karim Adiprasito, June Huh, and Eric Katz).
#+end_abstract

* Algebraic Geometry (Algebra 3)                                         
:properties:
:where: Australian National University
:when:     2019
:links: [[id:002e6919-5253-4a3e-bc15-6c86ffd4b5fc][course page]]
:ID:       3965100b-6648-46fb-a60a-75472f5f6361
:end:

* Elliptic curves and modular forms
:properties:
:where: Australian National University
:when:     2018
:comments: Reading course based on N. Koblitz's book
:ID:       22179c29-cba8-4c10-80f9-b8a5fff7ab3b
:end:

* Computational Polynomial Algebra
:properties:
:where: Australian National University
:when:     2018
:comments: with Markus Hegland
:ID:       f7cb4d66-9f1d-4aba-a4a3-9e243c681516
:end:

* Algebraic curves
:properties:
:where: Australian National University
:when:     2018
:comments: Reading course based on R. Miranda's book
:links: [[id:e7d9e1d1-6dec-4d0a-acfe-087d10ba2836][course page]]
:ID:       09d2ce6c-c212-44ce-bff6-7bda65a5a0a3
:end:

* Precalculus
:properties:
:where: University of Georgia
:when:     2017
:ID:       4b65408e-d971-4ce5-ab90-eec53be5c3be
:end:

* Algebraic curves                                                :highlight:
:properties:
:where: University of Georgia
:when:     2017
:links: [[id:c0b9ba79-93e6-41cf-909e-efd0be13a8de][course page]]
:ID:       2a240d8e-a930-4e2c-a160-d39ff51e7447
:end:

* Calculus
:properties:
:where: University of Georgia
:when:     2017
:ID:       00887702-519f-4a09-9a3c-586e23fdfc9a
:end:

* Calculus  
:properties:
:where: University of Georgia
:when:     2016
:ID:       bee7a66e-df29-475c-aa5b-c820fbea24fa
:end:

* Analysis and optimization
:properties:
:where: Columbia University
:when:     2016
:links:     [[file:teaching/2016_analysis_and_optimization/][course page]]
:ID:       0d50d94e-d988-49a0-9b46-4088497dd0a2
:end:

* Young tableaux in algebra and geometry                          :highlight:
:properties:
:where: Columbia University
:when:     2015
:links: [[file:teaching/2015_young_tableaux/][course page]]
:ID:       6b8e011c-0df8-46e7-9674-48d1dcea50f5
:end:

* Calculus                                                               
:properties:
:where: Columbia University
:when:     2015
:links: [[file:teaching/2015_calculus1/][course page]]
:ID:       3f9ad86b-bc33-41b9-ad36-a85b69718621
:end:

