teaching.html
<div id="outline-container-ID-1680737a-9d54-448d-8951-a0fe1ae16016" class="outline-2">
<h2 id="ID-1680737a-9d54-448d-8951-a0fe1ae16016">Algebraic Geometry (Algebra 3)</h2>
<div class="outline-text-2" id="text-orge792da5">
<div class="properties" id="org62345aa">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2021</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Australian National University</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="teaching/2021_algebraic_geometry/index.html#ID-d86f42ff-f826-4c2a-9e1f-b85a7934e6c0">course page</a></td>
</tr>
</tbody>
</table>

</div>
</div>
<ul class="org-ul">
<li><a id="orgbd2677f"></a>What links here?<br />
<div class="outline-text-3" id="text-orgbd2677f">
<ul class="org-ul">
<li><a href="index.html#ID-d990bcc9-227c-4e82-9e93-512139e14f45">Home</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-ID-22f29317-d339-4e49-b46a-17a34e0b6091" class="outline-2">
<h2 id="ID-22f29317-d339-4e49-b46a-17a34e0b6091">Foundations of Algebraic Geometry: Schemes</h2>
<div class="outline-text-2" id="text-org37b80dc">
<div class="properties" id="org9f6f0f6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2020</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Australian National University</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="teaching/2020_schemes/index.html#ID-bf031ad4-94a5-42bd-8606-70e9cf0aec5f">course page</a></td>
</tr>
</tbody>
</table>

</div>
</div>
<ul class="org-ul">
<li><a id="org96a23eb"></a>What links here?<br />
<div class="outline-text-3" id="text-org96a23eb">
<ul class="org-ul">
<li><a href="index.html#ID-d990bcc9-227c-4e82-9e93-512139e14f45">Home</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-ID-7ec3cecb-0b39-4dac-bafc-8964f7cdded3" class="outline-2">
<h2 id="ID-7ec3cecb-0b39-4dac-bafc-8964f7cdded3">Seminar on Hodge theory</h2>
<div class="outline-text-2" id="text-orge8c2e0e">
<div class="properties" id="orge5b94fd">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2019</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">Australian National University</td>
</tr>
</tbody>
</table>

</div>


<p>
Here is the abstract.
</p>

<div class="abstract" id="org37e4dd3">
<p>
Over 3 weeks, we will review classical notions of Hodge structures and how they arise in complex algebraic geometry. We will then try to understand the construction of Hodge structures from categories of representations (by Geordie Williamson and Ben Elias) and combinatorial geometry (by Peter McMullen, Karim Adiprasito, June Huh, and Eric Katz).
</p>

</div>
</div>
</div>
<div id="outline-container-ID-3965100b-6648-46fb-a60a-75472f5f6361" class="outline-2">
<h2 id="ID-3965100b-6648-46fb-a60a-75472f5f6361">Algebraic Geometry (Algebra 3)</h2>
<div class="outline-text-2" id="text-orgf03933c">
<div class="properties" id="orgb49fabd">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2019</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Australian National University</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="teaching/2019_algebraic_geometry/index.html#ID-002e6919-5253-4a3e-bc15-6c86ffd4b5fc">course page</a></td>
</tr>
</tbody>
</table>

</div>
</div>
</div>
<div id="outline-container-ID-22179c29-cba8-4c10-80f9-b8a5fff7ab3b" class="outline-2">
<h2 id="ID-22179c29-cba8-4c10-80f9-b8a5fff7ab3b">Elliptic curves and modular forms</h2>
<div class="outline-text-2" id="text-orgdb33d9c">
<div class="properties" id="org88f4843">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2018</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Australian National University</td>
</tr>

<tr>
<td class="org-left"><b>comments</b></td>
<td class="org-left">Reading course based on N. Koblitz&rsquo;s book</td>
</tr>
</tbody>
</table>

</div>
</div>
</div>
<div id="outline-container-ID-f7cb4d66-9f1d-4aba-a4a3-9e243c681516" class="outline-2">
<h2 id="ID-f7cb4d66-9f1d-4aba-a4a3-9e243c681516">Computational Polynomial Algebra</h2>
<div class="outline-text-2" id="text-org2833917">
<div class="properties" id="org9e9c741">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2018</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Australian National University</td>
</tr>

<tr>
<td class="org-left"><b>comments</b></td>
<td class="org-left">with Markus Hegland</td>
</tr>
</tbody>
</table>

</div>
</div>
</div>
<div id="outline-container-ID-09d2ce6c-c212-44ce-bff6-7bda65a5a0a3" class="outline-2">
<h2 id="ID-09d2ce6c-c212-44ce-bff6-7bda65a5a0a3">Algebraic curves</h2>
<div class="outline-text-2" id="text-org175f369">
<div class="properties" id="orga2a4ac8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2018</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Australian National University</td>
</tr>

<tr>
<td class="org-left"><b>comments</b></td>
<td class="org-left">Reading course based on R. Miranda&rsquo;s book</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="teaching/2018_algebraic_curves/index.html#ID-e7d9e1d1-6dec-4d0a-acfe-087d10ba2836">course page</a></td>
</tr>
</tbody>
</table>

</div>
</div>
</div>
<div id="outline-container-ID-4b65408e-d971-4ce5-ab90-eec53be5c3be" class="outline-2">
<h2 id="ID-4b65408e-d971-4ce5-ab90-eec53be5c3be">Precalculus</h2>
<div class="outline-text-2" id="text-org9ec36b8">
<div class="properties" id="orgf0e79d8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2017</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">University of Georgia</td>
</tr>
</tbody>
</table>

</div>
</div>
</div>
<div id="outline-container-ID-2a240d8e-a930-4e2c-a160-d39ff51e7447" class="outline-2">
<h2 id="ID-2a240d8e-a930-4e2c-a160-d39ff51e7447">Algebraic curves</h2>
<div class="outline-text-2" id="text-org421d0d5">
<div class="properties" id="orgfe90391">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2017</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">University of Georgia</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="teaching/2017_algebraic_curves/index.html#ID-c0b9ba79-93e6-41cf-909e-efd0be13a8de">course page</a></td>
</tr>
</tbody>
</table>

</div>
</div>
<ul class="org-ul">
<li><a id="org68122ee"></a>What links here?<br />
<div class="outline-text-3" id="text-org68122ee">
<ul class="org-ul">
<li><a href="index.html#ID-d990bcc9-227c-4e82-9e93-512139e14f45">Home</a></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-ID-00887702-519f-4a09-9a3c-586e23fdfc9a" class="outline-2">
<h2 id="ID-00887702-519f-4a09-9a3c-586e23fdfc9a">Calculus</h2>
<div class="outline-text-2" id="text-org34865d0">
<div class="properties" id="orgc107bbd">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2017</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">University of Georgia</td>
</tr>
</tbody>
</table>

</div>
</div>
</div>
<div id="outline-container-ID-bee7a66e-df29-475c-aa5b-c820fbea24fa" class="outline-2">
<h2 id="ID-bee7a66e-df29-475c-aa5b-c820fbea24fa">Calculus</h2>
<div class="outline-text-2" id="text-org90291c4">
<div class="properties" id="org6784551">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-right">2016</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-right">University of Georgia</td>
</tr>
</tbody>
</table>

</div>
</div>
</div>
<div id="outline-container-ID-0d50d94e-d988-49a0-9b46-4088497dd0a2" class="outline-2">
<h2 id="ID-0d50d94e-d988-49a0-9b46-4088497dd0a2">Analysis and optimization</h2>
<div class="outline-text-2" id="text-orgc80132c">
<div class="properties" id="orgeec06f6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2016</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Columbia University</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="teaching/2016_analysis_and_optimization/">course page</a></td>
</tr>
</tbody>
</table>

</div>
</div>
</div>
<div id="outline-container-ID-6b8e011c-0df8-46e7-9674-48d1dcea50f5" class="outline-2">
<h2 id="ID-6b8e011c-0df8-46e7-9674-48d1dcea50f5">Young tableaux in algebra and geometry</h2>
<div class="outline-text-2" id="text-org5de9213">
<div class="properties" id="org999d70d">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>when</b></td>
<td class="org-left">2015</td>
</tr>

<tr>
<td class="org-left"><b>where</b></td>
<td class="org-left">Columbia University</td>
</tr>

<tr>
<td class="org-left"><b>links</b></td>
<td class="org-left"><a href="teaching/2015_young_tableaux/">course page</a></td>
</tr>
</tbody>
</table>

</div>
</div>
<ul class="org-ul">
